var christmasMovies = ['Один дома', 'Эльф', 'Рождественские каникулы', 'Подарок на рождество'];
debugger;
var movies = '';
for (var j = 0; j < 3; j++) {
    movies += christmasMovies[j];
}
console.log(movies);

christmasMovies[2] += movies;

alert(christmasMovies);
// я не знаю зачем нужна эта возможность, думала мне это на курсах расскажут)) это все равно,
// что идти изучать медицину и на первом занятии размышлять "как же воздействует анальгин на организм человека?"Да от куда я знаю!? расскажите мне, я ж не просто так сюда пришла))

